; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v11)
             (pred_9 ?v3 ?v10)
             (pred_7 ?v2 ?v10)
             (pred_5 ?v7 ?v2 )
	     (pred_3 ?v2)
             (pred_8 ?v1)
             (pred_12 ?v3)
             (pred_11 ?v10)
             (pred_1 ?v2)
             (pred_4 ?v3)
             (pred_6 ?v2)
             (pred_2 ))



(:action op_1
:parameters (?v9 ?v8 ?v6 ?v4)
:precondition (and (pred_8 ?v9) (pred_8 ?v8) (pred_12 ?v6) (pred_11 ?v4)
          (pred_10 ?v9 ?v8) (pred_9 ?v6 ?v4)
                   (pred_7 ?v8 ?v4) (pred_3 ?v9) 
                   (pred_1 ?v8) (pred_4 ?v6))
:effect (and  (pred_6 ?v8) (not (pred_1 ?v8))))


(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_8 ?v9) (pred_8 ?v12)
               (pred_3 ?v9) (pred_10 ?v9 ?v12) (pred_6 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v9))))

(:action op_2
:parameters (?v9 ?v6)
:precondition (and (pred_8 ?v9) (pred_12 ?v6) 
                  (pred_3 ?v9) (pred_5 ?v6 ?v9) (pred_2 ))
:effect (and (pred_4 ?v6)
   (not (pred_5 ?v6 ?v9)) (not (pred_2 ))))


(:action op_3
:parameters (?v9 ?v13 ?v5)
:precondition (and (pred_8 ?v9) (pred_12 ?v13) (pred_12 ?v5)
                  (pred_3 ?v9) (pred_4 ?v5) (pred_5 ?v13 ?v9))
:effect (and (pred_4 ?v13) (pred_5 ?v5 ?v9)
        (not (pred_4 ?v5)) (not (pred_5 ?v13 ?v9))))

(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_8 ?v9) (pred_12 ?v6) 
                  (pred_3 ?v9) (pred_4 ?v6))
:effect (and (pred_2 ) (pred_5 ?v6 ?v9) (not (pred_4 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_17 obj_11 obj_03 obj_18 obj_12 obj_04 obj_10 obj_08 obj_20 obj_16 obj_19 obj_06 obj_07 obj_02 obj_14
    obj_15 obj_05
    obj_13 obj_09 obj_01
    )

    (:init
       (pred_2)

       (pred_8 obj_21)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_18)
       (pred_8 obj_12)
       (pred_8 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_14)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_01)

       (pred_10 obj_21 obj_18)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_08 obj_06)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_08)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_14 obj_02)
       (pred_1 obj_04)
       (pred_1 obj_10)
       (pred_1 obj_16)
       (pred_7  obj_04 obj_15)
       (pred_7  obj_10 obj_05)
       (pred_7  obj_16 obj_05)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_02)
       (pred_6 obj_14)

       (pred_9  obj_13 obj_15)
       (pred_9  obj_09 obj_05)
       (pred_9  obj_01 obj_05)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_01 obj_07)
       (pred_3 obj_02)
    )

    (:goal (and
       (pred_5 obj_01 obj_17)
    ))
(:constraints
  (always (not (pred_3 obj_20)))
)
)

; plan
1. (op_4 obj_02 obj_07)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_07)
   goals met: 0 of 1
2. (op_2 obj_07 obj_01)
   deleted: (pred_5 obj_01 obj_07) (pred_2)
   added: (pred_4 obj_01)
   goals met: 0 of 1
3. (op_4 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_06)
   goals met: 0 of 1
4. (op_4 obj_06 obj_08)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_08)
   goals met: 0 of 1
5. (op_4 obj_08 obj_18)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_18)
   goals met: 0 of 1
6. (op_4 obj_18 obj_21)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_21)
   goals met: 0 of 1
7. (op_4 obj_21 obj_17)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_17)
   goals met: 0 of 1
8. (op_5 obj_17 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_2) (pred_5 obj_01 obj_17)
   goals met: 1 of 1
